In [1]:
import pandas as pd
import sqlite3

### Create Database

In [2]:
conn = sqlite3.connect("database/crud.db")
conn.close()

### Create Table

* PRIMARY KEY
* FOREIGN KEY 
* CHECK constraint 
* NOT NULL
* DEFAULT
* Index

In [15]:
conn = sqlite3.connect('database/crud.db')
 
cursor_obj = conn.cursor()
 
cursor_obj.execute("DROP TABLE IF EXISTS Student")
 
# table = """ CREATE TABLE Student (
#             Student_id INTEGER AUTO_INCREMENT PRIMARY KEY,
#             Email VARCHAR(255) UNIQUE,
#             First_Name VARCHAR(25) NOT NULL,
#             Last_Name VARCHAR(25) NOT NULL,
#             Middle_Name VARCHAR(25),
#             Age int CHECK (Age<=12),
#             Added_Date TIMESTAMP DEFAULT CURRENT_TIMESTAMP
#         ); """
 
table = """ CREATE TABLE Student (
            Student_id INTEGER PRIMARY KEY,
            Email VARCHAR(255) UNIQUE,
            First_Name VARCHAR(25) NOT NULL,
            Last_Name VARCHAR(25) NOT NULL,
            Middle_Name VARCHAR(25),
            Age int CHECK (Age<=12),
            Added_Date TIMESTAMP DEFAULT CURRENT_TIMESTAMP
        ); """
     
cursor_obj.execute(table)
 
print("Table is Ready")
 
# Close the connection
conn.close()

Table is Ready

In [4]:
conn = sqlite3.connect('database/crud.db')

query = """
SELECT * FROM sqlite_schema WHERE type='table';
"""
select_df = pd.read_sql_query(query, conn)
conn.close()

select_df.head()

,type,name,tbl_name,rootpage,sql
0,table,Student,Student,2,CREATE TABLE Student (\n Student_id...

In [19]:
print(select_df['sql'][0])

CREATE TABLE Student (
            Student_id INTEGER PRIMARY KEY,
            Email VARCHAR(255) UNIQUE,
            First_Name VARCHAR(25) NOT NULL,
            Last_Name VARCHAR(25) NOT NULL,
            Middle_Name VARCHAR(25),
            Age int CHECK (Age<=12),
            Added_Date TIMESTAMP DEFAULT CURRENT_TIMESTAMP
        )

### Alter Table Name

In [5]:
conn = sqlite3.connect('database/crud.db')
 
cursor_obj = conn.cursor()
 
table = """ 
ALTER TABLE Student
RENAME TO Student_1;
"""
 
cursor_obj.execute(table)
 
print("Table is Ready")
 
# Close the connection
conn.close()

Table is Ready

### Alter Table Properties

In [16]:
conn = sqlite3.connect('database/crud.db')
 
cursor_obj = conn.cursor()
 
table = """ 
ALTER TABLE Student
ADD COLUMN Gender char(1);
"""
 
cursor_obj.execute(table)
 
print("Table is Ready")
 
# Close the connection
conn.close()

Table is Ready

In [20]:
conn = sqlite3.connect('database/crud.db')

query = """
SELECT * FROM sqlite_schema WHERE type='table';
"""
select_df = pd.read_sql_query(query, conn)
conn.close()

select_df.head()

,type,name,tbl_name,rootpage,sql
0,table,Student_1,Student_1,2,"CREATE TABLE ""Student_1"" (\n Studen..."
1,table,Student,Student,4,CREATE TABLE Student (\n Student_id...

### Insert

In [22]:
import sqlite3

conn = sqlite3.connect('database/crud.db')
print("Opened database successfully")

conn.execute("""
INSERT INTO Student (Email, First_Name, Last_Name, Age) 
VALUES ('test@gmail.com', 'Juan', 'dela Cruz', 8)
"""
);

# conn.execute("""
# INSERT INTO STUDENT (Email, Middle_Name, Last_Name, Age) 
# VALUES ('test@gmail.com', 'Juan', 'dela Cruz', 8)
# """
# );

# conn.execute("""
# INSERT INTO STUDENT (Email, First_Name, Last_Name, Age) 
# VALUES ('test@gmail.com', 'Juan', 'dela Cruz', 13)
# """
# );

# conn.execute("""
# INSERT INTO STUDENT (Email, First_Name, Last_Name, Age) 
# VALUES ('test@gmail.com', 'Juan', 'dela Cruz', 8)
# """
# );


conn.commit()
print("Records created successfully")
conn.close()

Opened database successfully
Records created successfully

### Batch Insert

In [23]:
students = [
#     ("test@gmail.com", "Juan", "dela Cruz", 8),
    ("test_1@gmail.com", "Juan_1", "dela Cruz", 8),
    ("test_2@gmail.com", "Juan_2", "dela Cruz", 8),
    ("test_3@gmail.com", "Juan_1", "dela Cruz", 8),
    ("test_4@gmail.com", "Juan_2", "dela Cruz", 8)
]

conn = sqlite3.connect("database/crud.db")
# Fill the table
conn.executemany("INSERT INTO STUDENT(Email, First_Name, Last_Name, Age) values (?, ?, ?, ?)", students)
conn.commit()
conn.close()

### Select

In [24]:
conn = sqlite3.connect('database/crud.db')

query = """
SELECT * FROM Student;
"""
select_df = pd.read_sql_query(query, conn)
conn.close()

select_df.head()

,Student_id,Email,First_Name,Last_Name,Middle_Name,Age,Added_Date,Gender
0,1,test@gmail.com,Juan,dela Cruz,None,8,2022-06-07 08:37:35,None
1,2,test_1@gmail.com,Juan_1,dela Cruz,None,8,2022-06-07 08:37:41,None
2,3,test_2@gmail.com,Juan_2,dela Cruz,None,8,2022-06-07 08:37:41,None
3,4,test_3@gmail.com,Juan_1,dela Cruz,None,8,2022-06-07 08:37:41,None
4,5,test_4@gmail.com,Juan_2,dela Cruz,None,8,2022-06-07 08:37:41,None

### Update

* UPDATE table_name SET column1 = value1, column2 = value2, ... WHERE condition;

In [25]:
conn = sqlite3.connect("database/crud.db")
conn.execute("UPDATE Student SET First_Name=? WHERE Student_id=?", ('Maria',1))
conn.commit()
conn.close()

### Delete

* DELETE FROM table_name WHERE condition;

In [26]:
conn = sqlite3.connect("database/crud.db")
conn.execute("DELETE FROM Student WHERE First_Name=?", ('Maria',))
conn.commit()
conn.close()

### Drop Table

In [27]:
conn = sqlite3.connect("database/crud.db")
conn.execute("Drop Table Student")
conn.commit()
conn.close()

In [28]:
conn = sqlite3.connect('database/crud.db')

query = """
SELECT * FROM sqlite_schema WHERE type='table';
"""
select_df = pd.read_sql_query(query, conn)
conn.close()

select_df.head()

,type,name,tbl_name,rootpage,sql
0,table,Student_1,Student_1,2,"CREATE TABLE ""Student_1"" (\n Studen..."